
<!DOCTYPE html>
<html>
    <head>
        <title>LLDM Queens</title>

        <!--add tags for mobile phone use-->
            <meta name="viewport" content="width=device-width, initial-scale=1">
        <!-- google verfication -->
        <meta name="google-site-verification" content="KPGsTfDpX-yO-8UFlcEd9IaLjp-bSarpnlSckg9OmnU" />
        <!-- <link href="favicon.ico" rel="icon" type="image/x-icon" /> -->
        <link href="favicon.ico" rel="shortcut icon" type="image/x-icon" />
        <!--style sheet-->
            <link rel="stylesheet" type="text/css" href="assets/css/secondCss.css">

    </head>

    <body>

        <div class="horizontal top-bar">
            <a href="index.html"><img src="assets/img/escudo.png" alt="NJG" /></a>

            <div class="lang">
                <p><a href="NJG_eng.html">ENG</a></p>
            </div>

        </div>

        <section class='column log-wrap'>
            <div id="home" class="column logo">
                <p id="iglesia" style="opacity:0;">CHURCH&#183;OF&#183;THE&#183;LIVING&#183;GOD</p>
                <p id="columna" style="opacity:0;">PILLAR&#183;AND&#183;FOUNDATION&#183;OF&#183;THE&#183;TRUTH</p>
                <p id="luz" style="opacity:0;">THE&#183;LIGHT&#183;OF&#183;THE&#183;WORLD</p>
                <div class="line"></div>
                <p id ="state" style="opacity:0;">Queens&#183;NY</p>
            </div>
        </section>

        <!-- make site wrapper flex row -->
        <section class="column site-wrapper">
            <div class="column content">
                <div class ="header">
                    <p>Naas&#243;n Joaqu&#237;n Garc&#237;a</p>
                </div>

                <div class="title">
                    <p>Apostle of JesusChrist</p>
                </div>

                <div class="banner">
                    <img src="assets/img/sog1.jpg" alt="NJG" />
                </div>

                <div class="bio-button">
                    <p>Bio</p>
                </div>

                <div class="bio">

                    <p>The Apostle of JesusChrist, Naas&#243;n Joaqu&#237;n Garc&#237;a,

                    current International Director of the Light of the World church,

                    was born May 7 1969, in the city of Guadalajara, Jalisco.

                    Being a child of the late Apostle Samuel Joaqu&#237;n Flores and wife

                    Eva Garc&#237;a L&#243;pez, he is the fifth of eight children procreated

                    by the marriage. He lived his infant and adolescent years in his hometown

                    of Hermosa Provincia (Beautiful Province).</br></br>

                    From his teenage years onward, the Apostle Naas&#243;n Joaqu&#237;n

                    experienced the satisfaction that comes from offering service to God.

                    </br></br>

                    &rtrif; In 1983, at the age of 14, he took his first step in his profession

                    of faith: he was baptized in the name of JesusChrist.</br>

                    &rtrif; In the following years, while still in his adolescence, along with other youth,

                    he integrated himself to the Group of Laborers of the Beautiful Province, where

                    he developed his evangelizational work while in the provinces of the Zona Metropolitana of

                    Guadalajara.</br>

                    &rtrif; Similarly, during the mid eighties, he accompanied a

                    group of missionaries that were located in the country of Spain. His time spent in the Iberian peninsula

                    , which included giving testimony of the Christian faith throughout the homes and plazas

                    , became an experience that would be forever recorded in his memory.</br>

                    &rtrif; Another blessing that he experienced was, without a doubt, having accompanied his father, the

                    Apostle Samuel Joaqu&#237;n, in trips within the Mexican Republic

                     and abroad.</br>

                    &rtrif; At the age of 17, brother

                    Naas&#243;n Joaqu&#237;n assumes his first responsibility: the Apostle

                    Samuel Joaqu&#237;n places him in charge of the younger group of teenagers in the church

                    of the Beautiful Province, on August 25 1986.</br>

                    &rtrif; Subsequently, on May 10 1992, he was placed in charge of the older youth

                    , and on June 14 of that same year, he married

                    sister Alma Zamora Espinoza, in Guadalajara, with whom engendered

                    three children: Adoraim, Eldai and Sibma.</br></br>

                    In his 28 year trajectory of pastoral work, from

                    December 1992 to December 2014, he was in charge of the following congregations:</br>

                    Phoenix y Tucson, AZ; Huntington Park, CA; Southern Los &Aacute;ngeles, CA;

                    Santa Mar&#237;a, CA; Los &Aacute;ngeles, CA; San Diego, CA; Santa Ana, CA.</br></br>

                    During the course of his work as a minister, he was anoinment as

                    Deacon Evangelist (1994), and later Pastor Evangelist (2000).</br></br>

                    A la par de su labor pastoral, el Ap&#243;stol Naas&#243;n Joaqu&#237;n

                    trabaj&#243; con dedicaci&#243;n en otras responsabilidades: fue director de la

                    Jurisdicci&#243;n Norte de la Iglesia La Luz del Mundo (2003-2014), which includes

                    the states of Baja California, Baja California South, Sonora, Chihuahua,

                    Nuevo Le&#243;n and Tamaulipas, en donde tuvo a su cargo la supervisi&#243;n y

                    atenci&#243;n a las necesidades espirituales y materiales de las congregaciones

                    asentadas en dicha demarcaci&#243;n.</br></br>

                    Con el prop&#243;sito de promover la difusi&#243;n de la doctrina cristiana

                    a trav&#233;s de los medios de comunicaci&#243;n, el Ap&#243;stol Naas&#243;n

                    Joaqu&#237;n dise&#324;&#243; y organiz&#243; &ldquo;Comunication Center Berea USA&rdquo;

                    (CCB USA). Esta instancia medi&#225;tica, que entr&#243; en operaci&#243;n en

                    Agosto de 2009, adem&#225;s de tener un enfoque cultural y de divulgaci&#243;n,

                    es la responsable de transmitir la se&#324;al de video de los eventos m&#225;s

                    importantes de la Iglesia La Luz del Mundo &minus;santas cenas, presentaciones

                    apost&#243;licas, inauguraciones de templos, estudios b&#237;blicos,

                    etc&#233;tera&minus; a nivel mundial.</br></br>

                    Por razones de espacio, no abundar&#233; sobre

                    el apoyo brindado la plataforma de profesionistas del pa&#237;s vecino &minus;

                    The Association of Professionals & Students (APS), ni de las giras c&#237;vicas

                    de trabajo a favor del respeto a los derechos humanos, la libertad de creencias,

                    la educaci&#243;n laica y la no discriminaci&#243;n &minus;que tuvieron lugar en 2007

                    y 2009 en el norte de la Rep&#250;blica Mexicana&minus;, ni de su cercan&#237;a con

                    las instancias educativas, entre otras acciones dignas de encomio.</br></br>

                    <span>14 de Diciembre de 2014</span></br>

                    Inicio de su ministerio apost&#243;lico</br></br>

                    El 8 de diciembre de 2014, a las 6:10 de la ma&#324;ana, el Ap&#243;stol de

                    Jesucristo Samuel Joaqu&#237;n &minus;quien dirigi&#243; la Iglesia La Luz del

                    Mundo durante 50 a&#324;os&minus; parti&#243; al descanso de los justos. En ese

                    d&#237;a, minutos despu&#233;s del deceso, el Hermano Naas&#243;n Joaqu&#237;n

                    busc&#243; un espacio en una de las habitaciones de la casa paterna, donde, afligido

                    por la situaci&#243;n, elev&#243; una oraci&#243;n a Dios: &ldquo;Se&#324;or

                    &iexcl;Consu&#233;lame&excl; &iexcl;Me duele mucho Se&#324;or&excl;&rdquo;. La respuesta divina no tard&#243;:

                    en aquella plegaria, el Ap&#243;stol de Jesucristo escuch&#243; una voz muy fuerte,

                    una voz como estruendo, como corrientes de muchas aguas, que le dec&#237;a:

                    </p></br>

                    <blockquote>

                        &ldquo;&iquest;Por qu&#233; me pides consuelo&quest;, si t&#250; has de consolar a mi Pueblo&mldr;

                    Naas&#243;n, &iexcl;t&#250; estar&#225;s al frente de este grande Pueblo; y si hoy lo

                    ves grande, yo lo voy a multiplicar a&#250;n mucho m&#225;s&excl; Honra el cuerpo de mi

                    Siervo Samuel y el pr&#243;ximo domingo te levantar&#225;s al Pueblo&mldr; Yo abrir&#233;

                    su coraz&#243;n y, aun, el del Cuerpo Ministerial como un solo hombre, y har&#233;

                    la obra perfecta&rdquo;</br> (Cf. Carta Apost&#243;lica, 20 de diciembre de 2014, Silao, Gto).

                    </blockquote></br>

                    <p>
                        El domingo 14 de Diciembre de 2014 fue la fecha se&#324;alada. Al igual que los

                    d&#237;as precedentes, el templo sede internacional y sus calles adyacentes se

                    encontraban plet&#243;ricos. En oraci&#243;n y s&#250;plica, la Iglesia esperaba la

                    manifestaci&#243;n de la Elecci&#243;n Apost&#243;lica. Este acto sublime, el de

                    reconocer la identidad de un Enviado de Dios, tuvo lugar a las 2:43 de la

                    ma&#324;ana. En este instante, la Iglesia y los ministros reconocieron el

                    Ministerio Apost&#243;lico del Hermano Naas&#243;n Joaqu&#237;n Garc&#237;a,

                    y, de manera un&#225;nime, le dieron sus diestras de compa&#324;&#237;a. Cabe

                    recordar que esta obra &minus;la del reconocimiento espiritual&minus; no es humana, ya que

                    procede de lo Alto, de acuerdo con la ense&#324;anza b&#237;blica.

                    En su primer mensaje apost&#243;lico, que estuvo impregnado de seguridad,

                    esperanza y consuelo, record&#243;: </br></br>

                    &ldquo;No estabais solos, solamente hab&#237;a una

                    pausa. Hoy comienza una nueva era de triunfos, de victoria y de gloria para

                    Dios. Ahora que mi tiempo ha llegado, puedo decir con libertad:

                    Naas&#243;n Joaqu&#237;n Garc&#237;a, Siervo Dios y Ap&#243;stol de Jesucristo&rdquo;.</br></br>

                    El tiempo de dispensaci&#243;n en la Iglesia de Cristo continua vigente: su sello

                    de autenticidad es la presencia de un Ap&#243;stol. Ni m&#225;s ni menos.</br></br>

                    </p>
                </div>

                <div class="line"></div>

                <p class="notes">
                    &lsquo;Ap&oacute;stol Naas&oacute;n Joaqu&iacute;n: Una Semblanza Biogr&aacute;fica,&rsquo;</br>

                    author: Humberto Garc&iacute;a de la Mora </br>[El Occidental, 3 de enero de 2015, p. 6a].</span>
                </p>
            </div>
        </section>

        <div class="horizontal footer">
            <div class="column address">
                <p>Address</p>

                <p>37-38 92nd St</br>
                Queens, NY 11372</br></br>
                t: 718&middot;335&middot;2130</p>
            </div>

            <div class="column hours">
                <p>Hours of Worship</p>

                <p>Sunday</br>
                10:00 - 12:00</br>
                15:00 - 17:00</p>

                <p>Monday to Saturday</br>
                05:00 - 05:30</br>
                09:00 - 10:00</br>
                19:00 - 20:00</p>
            </div>

            <div class="social">
                <p>Follow Us</p>
                <p>
                    <a target="_blank" href="http://m2.facebook.com/queenslldm"><img src="assets/img/facebook.svg" alt="Lldmqueens NY" /></a>
                    <a target="_blank" href="https://www.youtube.com/channel/UCen_rk4V0cof2ZBBSScqoHg/videos"><img src="assets/img/youtube.svg" alt="Lldmqueens NY" /></a>
                </p>
            </div>
        </div>

        <div class="copy">
            <p>&copy;2015 LldmQueens</p>
        </div>

        <section id="menu">
            <div class="column slide">
                <ul>
                    <li><a href="index_eng.html">HOME</a></li>
                    <li><a href="NJG_eng.html">APOSTLE of JESUSCHRIST</a></li>
                    <li><a href="video_queens_eng.html">VIDEO</a></li>
                    <li><a href="contact_queens_eng.html">CONTACT</a></li>
                </ul>

                <div class="slide_social">
                    <a target="_blank" href="http://m2.facebook.com/queenslldm"><img src="assets/img/facebook.svg" alt="Lldmqueens NY" /></a>
                    <a target="_blank" href="https://www.youtube.com/channel/UCen_rk4V0cof2ZBBSScqoHg/videos"><img src="assets/img/youtube.svg" alt="Lldmqueens NY" /></a>
                </div>

                <div class="slide_footer">
                    <p>&copy;2015 LldmQueens</p>
                    <!-- <img src="assets/img/QLogo1.png" alt="queens" /> -->
                </div>
            </div>
        </section>

        <div id="trigger">
            <a href="#" class="nav-trigger">
                <span>Menu</span>
            </a>
        </div>


        <!--JavaScript files at end to save on load times -->
        <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
        <script src="//cdnjs.cloudflare.com/ajax/libs/velocity/1.2.2/velocity.min.js"></script>
        <script src="https://cdnjs.cloudflare.com/ajax/libs/velocity/1.2.2/velocity.ui.min.js"></script>
        <!--js-->
        <script src="assets/js/secondJS.js"></script>

    </body>
</html>
